{
  "model": [
    {
     "table": {
       "id": "AGPL2",
       "sentence": "2. You may modify your copy or copies of the Program or any portion of it, thus forming a work based on the Program, and copy and distribute such modifications or work under the terms of Section 1 above, provided that you also meet all of these conditions. a) You must cause the modified files to carry prominent notices stating that you changed the files and the date of any change. b) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License. c) If the modified program normally reads commands interactively when run, you must cause it, when started running for such interactive use in the most ordinary way, to print or display an announcement including an appropriate copyright notice and a notice that there is no warranty (or else, saying that you provide a warranty) and that users may redistribute the program under these conditions, and telling the user how to view a copy of this License. (Exception: if the Program itself is interactive but does not normally print such an announcement, your work based on the Program is not required to print an announcement.) d) If the Program as you received it is intended to interact with users through a computer network and if, in the version you received, any user interacting with the Program was given the opportunity to request transmission to that user of the Program's complete source code, you must not remove that facility from your modified version of the Program or work based on the Program, and must offer an equivalent opportunity for all users interacting with your Program through a computer network to request immediate transmission by HTTP of the complete source code of your modified version or other derivative work. These requirements apply to the modified work as a whole. If identifiable sections of that work are not derived from the Program, and can be reasonably considered independent and separate works in themselves, then this License, and its terms, do not apply to those sections when you distribute them as separate works. But when you distribute the same sections as part of a whole which is a work based on the Program, the distribution of the whole must be on the terms of this License, whose permissions for other licensees extend to the entire whole, and thus to each and every part regardless of who wrote it. Thus, it is not the intent of this section to claim rights or contest your rights to work written entirely by you; rather, the intent is to exercise the right to control the distribution of derivative or collective works based on the Program. In addition, mere aggregation of another work not based on the Program with the Program (or with a work based on the Program) on a volume of a storage or distribution medium does not bring the other work under the scope of this License.",
       "actor": "You",
       "modal": "may",
       "negative": "no",
       "verb": "copy",
       "action": "[you modified] your copy or copies of the Program or any portion of it, ... and [copied and distributed] such modifications or work",
       "preconditions": [
		  "(P6 and (P7 and P8)) and (P2 and (P3 and (P4 and P5)))",
		  "P2: $AGPL2a",
		  "P3: $AGPL2b",
		  "P4: $AGPL2c",
		  "P5: $AGPL2d",
		  "P6: $AGPL1a",
		  "P7: $AGPL1b",
		  "P8: $AGPL1c"
	   ]
     }
    }, 

    {
     "table": {
       "id": "AGPL2a",
       "sentence": "2.a) You must cause the modified files to carry prominent notices stating that you changed the files and the date of any change.",
       "actor": "You",
       "modal": "must",
       "negative": "no",
       "verb": "carry prominent notices",
       "action": "[you caused] the modified files to carry prominent notices stating that you changed the files and the date of any change",
       "preconditions": "[you intend to modify the Program, and copy and distribute such modifications]"
     }
    },

    {
     "table": {
       "id": "AGPL2b",
       "sentence": "2.b) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License.",
       "actor": "You",
       "modal": "must",
       "negative": "no",
       "verb": "be licensed as a whole",
       "action": "[you caused] any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License",
       "preconditions": "[you intend to modify the Program, and copy and distribute such modifications]"
     }
    },

    {
     "table": {
       "id": "AGPL2c",
       "sentence": "2.c) If the modified program normally reads commands interactively when run, you must cause it, when started running for such interactive use in the most ordinary way, to print or display an announcement including an appropriate copyright notice and a notice that there is no warranty (or else, saying that you provide a warranty) and that users may redistribute the program under these conditions, and telling the user how to view a copy of this License. (Exception: if the Program itself is interactive but does not normally print such an announcement, your work based on the Program is not required to print an announcement.)",
       "actor": "You",
       "modal": "must",
       "negative": "no",
       "verb": "print or display",
       "action": "[you caused the modified program] ... to print or display an announcement including an appropriate copyright notice and a notice that there is no warranty (or else, saying that you provide a warranty) and that users may redistribute the program under these conditions, and telling the user how to view a copy of this License",
       "preconditions": [
	      "P1 and (P2 or not P3)",
		  "P1: [you intend to modify the Program, and copy and distribute such modifications]",
		  "P2: the modified program normally reads commands interactively when run",
		  "P3: [original] Program itself is interactive but does not normally print such an announcement"
	   ]
     }
    },

    {
     "table": {
       "id": "AGPL2d",
       "sentence": "2.d) If the Program as you received it is intended to interact with users through a computer network and if, in the version you received, any user interacting with the Program was given the opportunity to request transmission to that user of the Program's complete source code, you must not remove that facility from your modified version of the Program or work based on the Program, and must offer an equivalent opportunity for all users interacting with your Program through a computer network to request immediate transmission by HTTP of the complete source code of your modified version or other derivative work.",
       "actor": "You",
       "modal": "must not",
       "negative": "yes",
       "verb": "remove that facility",
       "action": [
	      "not P1 and P2",
	      "P1: [you removed] that facility [to request transmission of source code] from your modified version of the Program or work based on the Program",
		  "P2: [you offered] an equivalent opportunity for all users interacting with your Program through a computer network to request immediate transmission by HTTP of the complete source code of your modified version or other derivative work"
	   ], 
	   "preconditions": [
	      "P1 and (P2 and P3)",
		  "P1: [you intend to modify the Program, and copy and distribute such modifications]",
		  "P2: the Program as you received it is intended to interact with users through a computer network",
		  "P3: in the version you received, any user interacting with the Program was given the opportunity to request transmission to that user of the Program's complete source code"
	   ] 
     }
    },
	
	{
     "table": {
       "id": "AGPL1",
       "sentence": "1. You may copy and distribute verbatim copies of the [original] Program's source code as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice and disclaimer of warranty; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the Program a copy of this License along with the Program.",
       "actor": "You",
       "modal": "may",
       "negative": "no",
       "verb": "copy",
       "action": "[you copied and distributed] verbatim copies of the [original] Program's source code",
       "preconditions": [
		  "P1 and (P2 and P3)",
		  "P1: $AGPL1a",
		  "P2: $AGPL1b",
		  "P3: $AGPL1c"
	   ]
     }
    }, 

	{
     "table": {
       "id": "AGPL1a",
       "sentence": "you [must] conspicuously and appropriately publish on each copy an appropriate copyright notice and disclaimer of warranty",
       "actor": "You",
       "modal": "must",
       "negative": "no",
       "verb": "publish",
       "action": "[you conspicuously and appropriately published] on each copy an appropriate copyright notice and disclaimer of warranty",
       "preconditions": [
	      "P1 or P2",
	      "P1: [you intend to copy and distribute verbatim copies of the original Program's source code]",
		  "P2: [you intend to modify the Program, and copy and distribute such modifications]"
	   ]
     }
    },

	{
     "table": {
       "id": "AGPL1b",
       "sentence": "[you must] keep intact all the notices that refer to this License and to the absence of any warranty",
       "actor": "You",
       "modal": "must",
       "negative": "no",
       "verb": "keep intact",
       "action": "[you kept intact] all the notices that refer to this License and to the absence of any warranty",
       "preconditions": [
	      "P1 or P2",
	      "P1: [you intend to copy and distribute verbatim copies of the original Program's source code]",
		  "P2: [you intend to modify the Program, and copy and distribute such modifications]"
	   ]
     }
    },

	{
     "table": {
       "id": "AGPL1c",
       "sentence": "[you must] give any other recipients of the Program a copy of this License along with the Program",
       "actor": "You",
       "modal": "must",
       "negative": "no",
       "verb": "gave",
       "action": "[you gave] any other recipients of the Program a copy of this License along with the Program",
       "preconditions": [
	      "P1 or P2",
	      "P1: [you intend to copy and distribute verbatim copies of the original Program's source code]",
		  "P2: [you intend to modify the Program, and copy and distribute such modifications]"
	   ]
     }
    }

  ]
}
 
